---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseRatio
source: html/c0e37738-1e90-5572-5b21-3d98bd0f00e7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseRatio Property

"Base Attachment Ratio"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentBaseRatio { get; }
```